Repository: prathameshpatil1001/temp
Catalog: temp/Localizable.xcstrings
Source language: en
Languages: hi, kn, mr, ta, te

source: %d EMIs left
hi: %d EMI बाकी
mr: %d EMI बाकी
ta: %d EMI மீதம்
te: %d EMIలు మిగిలి ఉన్నాయి

source: %d%% repaid
hi: %d%% चुकाया गया
mr: %d%% फेडले
ta: %d%% செலுத்தப்பட்டது
te: %d%% చెల్లించబడింది

source: %lld EMIs left
hi: %lld EMI बाकी
mr: %lld EMI बाकी
ta: %lld EMI மீதம்
te: %lld EMIలు మిగిలి ఉన్నాయి

source: %lld months
hi: %lld महीने

source: %lld Months
hi: %lld महीने

source: %lld Mos
hi: %lld महीने

# %lld-%lld months
source: %1$lld-%2$lld months
hi: %1$lld-%2$lld महीने
kn: %lld-%lld months

source: %lld%% repaid
hi: %lld%% चुकाया गया
mr: %lld%% फेडले
ta: %lld%% செலுத்தப்பட்டது
te: %lld%% చెల్లించబడింది

source: %lldth of month
hi: माह का %lld दिन

source: +44 Points
hi: +44 अंक

source: ₹%@ Paid
hi: ₹%@ भुगतान किया
mr: ₹%@ भरले
ta: ₹%@ செலுத்தப்பட்டது
te: ₹%@ చెల్లించబడింది

source: ₹%@ Total
hi: ₹%@ कुल
mr: ₹%@ एकूण
ta: ₹%@ மொத்தம்
te: ₹%@ మొత్తం

source: 1.0% Lower Interest Rates
hi: 1.0% कम ब्याज दरें
kn: 1.0% ಕಡಿಮೆ ಬಡ್ಡಿದರಗಳು
mr: 1.0% कमी व्याजदर
ta: 1.0% குறைந்த வட்டி விகிதங்கள்
te: 1.0% తక్కువ వడ్డీ రేట్లు

source: 2.4 Yrs
hi: 2.4 वर्ष
mr: 2.4 वर्षे
ta: 2.4 ஆண்டுகள்
te: 2.4 సంవత్సరాలు

source: 6 days left
hi: 6 दिन बाकी
mr: 6 दिवस शिल्लक
ta: 6 நாட்கள் மீதம்
te: 6 రోజులు మిగిలాయి

source: 14 Apr, 02:15 PM
hi: 14 अप्रैल, 02:15 PM

source: 14 Apr, 10:30 AM
hi: 14 अप्रैल, 10:30 AM

source: 18 monthly payments ending Oct 2027
hi: अक्टूबर 2027 तक 18 मासिक भुगतान।
kn: ಅಕ್ಟೋಬರ್ 2027ರಲ್ಲಿ ಅಂತ್ಯಗೊಳ್ಳುವ 18 ಮಾಸಿಕ ಪಾವತಿಗಳು
mr: ऑक्टोबर 2027 पर्यंत 18 मासिक पेमेंट्स
ta: அக் 2027 வரை 18 மாதாந்திர கட்டணங்கள்
te: అక్టోబర్ 2027తో ముగిసే 18 నెలవారీ చెల్లింపులు

source: 18 Months
hi: 18 महीने
kn: 18 ತಿಂಗಳುಗಳು

source: 20 Apr 2026
hi: 20 अप्रैल 2026
mr: 20 एप्रिल 2026
ta: 20 ஏப் 2026
te: 20 ఏప్రి 2026

source: 36 Months
hi: 36 महीने

source: 60% Complete
hi: 60% पूर्ण
mr: 60% पूर्ण
ta: 60% முடிந்தது
te: 60% పూర్తైంది

source: 100% paperless process.
hi: 100% पेपरलेस प्रक्रिया।
mr: 100% पेपरलेस प्रक्रिया.
ta: 100% காகிதமற்ற செயல்முறை.
te: 100% పేపర్‌లెస్ ప్రక్రియ.

source: A passkey was already added on this device.
hi: इस डिवाइस पर पहले से एक पासकी जोड़ी जा चुकी है।
mr: या डिव्हाइसवर पासकी आधीच जोडली आहे.
ta: இந்த சாதனத்தில் ஏற்கனவே ஒரு பாஸ்கீ சேர்க்கப்பட்டுள்ளது.
te: ఈ పరికరంలో ఇప్పటికే ఒక పాస్‌కీ జోడించబడింది.

source: Aadhaar Card
hi: आधार कार्ड
mr: आधार कार्ड
ta: ஆதார் அட்டை
te: ఆధార్ కార్డ్

source: Accessibility
hi: सरल उपयोग
kn: ಪ್ರವೇಶಯೋಗ್ಯತೆ
mr: प्रवेशयोग्यता
ta: அணுகல்தன்மை
te: యాక్సెసిబిలిటీ

source: Account Statements
hi: खाता विवरण
kn: ಖಾತೆ ವಿವರಗಳು
mr: खाते विवरणपत्रे
ta: கணக்கு அறிக்கைகள்
te: ఖాతా స్టేట్‌మెంట్‌లు

source: Action Required
hi: कार्रवाई आवश्यक
kn: ಕ್ರಮ ಅಗತ್ಯವಿದೆ
mr: कृती आवश्यक
ta: நடவடிக்கை தேவை
te: చర్య అవసరం

source: Active
hi: सक्रिय
kn: ಸಕ್ರಿಯ
mr: सक्रिय
ta: செயலில்
te: సక్రియం

source: Add %@ using
hi: %@ को इस तरह जोड़ें
mr: %@ असे जोडा
ta: %@ ஐ இதைப் பயன்படுத்தி சேர்க்கவும்
te: %@ ను ఇలా జోడించండి

source: Add a passkey to this device.
hi: इस डिवाइस में एक पासकी जोड़ें।
kn: ಈ ಸಾಧನಕ್ಕೆ ಪಾಸ್‌ಕಿ ಸೇರಿಸಿ.
mr: या डिव्हाइसवर पासकी जोडा.
ta: இந்த சாதனத்தில் ஒரு பாஸ்கீ சேர்க்கவும்.
te: ఈ పరికరానికి ఒక పాస్‌కీ జోడించండి.

source: Add employment details
hi: रोजगार विवरण जोड़ें
kn: ಉದ್ಯೋಗ ವಿವರಗಳನ್ನು ಸೇರಿಸಿ
mr: रोजगार तपशील जोडा
ta: வேலை விவரங்களைச் சேர்க்கவும்
te: ఉద్యోగ వివరాలను జోడించండి

source: Add income details
hi: आय विवरण जोड़ें
kn: ಆದಾಯ ವಿವರಗಳನ್ನು ಸೇರಿಸಿ
mr: उत्पन्न तपशील जोडा
ta: வருமான விவரங்களைச் சேர்க்கவும்
te: ఆదాయ వివరాలను జోడించండి

source: Add to Monthly EMI
hi: मासिक EMI में जोड़ें
mr: मासिक EMI मध्ये जोडा
ta: மாதாந்திர EMI-க்கு சேர்க்கவும்
te: నెలవారీ EMIకి జోడించండి

source: Add your basic details before we verify your documents.
hi: हम आपके दस्तावेज़ सत्यापित करें उससे पहले अपनी मूल जानकारी जोड़ें।
kn: ನಿಮ್ಮ ದಾಖಲೆಗಳನ್ನು ಪರಿಶೀಲಿಸುವ ಮೊದಲು ನಿಮ್ಮ ಮೂಲ ವಿವರಗಳನ್ನು ಸೇರಿಸಿ.
mr: आम्ही तुमचे दस्तऐवज पडताळण्यापूर्वी तुमचे मूलभूत तपशील जोडा.
ta: நாங்கள் உங்கள் ஆவணங்களை சரிபார்ப்பதற்கு முன் உங்கள் அடிப்படை விவரங்களைச் சேர்க்கவும்.
te: మేము మీ పత్రాలను ధృవీకరించే ముందు మీ ప్రాథమిక వివరాలను జోడించండి.

source: Added
hi: जोड़ा गया
kn: ಸೇರಿಸಲಾಗಿದೆ
mr: जोडले
ta: சேர்க்கப்பட்டது
te: జోడించబడింది

source: Added document
hi: दस्तावेज़ जोड़ा गया
kn: ಸೇರಿಸಿದ ದಾಖಲೆ
mr: दस्तऐवज जोडला
ta: ஆவணம் சேர்க்கப்பட்டது
te: పత్రం జోడించబడింది

source: Address line 1
hi: पता पंक्ति 1
kn: ವಿಳಾಸ ಸಾಲು 1
mr: पत्ता ओळ 1
ta: முகவரி வரி 1
te: చిరునామా పంక్తి 1

source: Address Proof
hi: पते का प्रमाण
kn: ವಿಳಾಸದ ಸಾಕ್ಷ್ಯ
mr: पत्त्याचा पुरावा
ta: முகவரி சான்று
te: చిరునామా రుజువు

source: Adjust EMI or tenure to see how your loan changes.
hi: अपना ऋण कैसे बदलता है यह देखने के लिए EMI या अवधि समायोजित करें।
kn: ನಿಮ್ಮ ಸಾಲ ಹೇಗೆ ಬದಲಾಗುತ್ತದೆ ಎಂದು ನೋಡಲು EMI ಅಥವಾ ಅವಧಿಯನ್ನು ಬದಲಿಸಿ.
mr: तुमचे कर्ज कसे बदलते ते पाहण्यासाठी EMI किंवा कालावधी समायोजित करा.
ta: உங்கள் கடன் எப்படி மாறுகிறது என்பதை பார்க்க EMI அல்லது காலத்தை மாற்றுங்கள்.
te: మీ రుణం ఎలా మారుతుందో చూడటానికి EMI లేదా కాలపరిమితిని సర్దుబాటు చేయండి.

source: Adjust Tenure
hi: अवधि समायोजित करें
kn: ಅವಧಿಯನ್ನು ಹೊಂದಿಸಿ
mr: कालावधी समायोजित करा
ta: காலத்தை மாற்றவும்
te: కాలపరిమితిని సర్దుబాటు చేయండి

source: After you sign in, open Settings and enable the authenticator from the security section.
hi: साइन इन करने के बाद Settings खोलें और सुरक्षा अनुभाग से ऑथेंटिकेटर सक्षम करें।
mr: साइन इन केल्यानंतर Settings उघडा आणि सुरक्षा विभागातून authenticator सक्षम करा.
ta: உள்நுழைந்த பிறகு Settings திறந்து பாதுகாப்பு பகுதியில் authenticator ஐ இயலுமைப்படுத்தவும்.
te: సైన్ ఇన్ చేసిన తర్వాత Settings తెరిచి భద్రత విభాగంలో authenticator ను ప్రారంభించండి.

source: Alerts
hi: अलर्ट
kn: ಎಚ್ಚರಿಕೆಗಳು
mr: सूचना
ta: எச்சரிக்கைகள்
te: హెచ్చరికలు

source: All verification steps are complete
hi: सभी सत्यापन चरण पूर्ण हैं
kn: ಎಲ್ಲ ಪರಿಶೀಲನಾ ಹಂತಗಳು ಪೂರ್ಣಗೊಂಡಿವೆ
mr: सर्व पडताळणी टप्पे पूर्ण झाले आहेत
ta: அனைத்து சரிபார்ப்பு படிகளும் முடிந்துவிட்டன
te: అన్ని ధృవీకరణ దశలు పూర్తయ్యాయి

source: Already have an account?
hi: पहले से खाता है?
kn: ಈಗಾಗಲೇ ಖಾತೆ ಇದೆಯೆ?
mr: आधीच खाते आहे?
ta: ஏற்கனவே கணக்கு உள்ளதா?
te: ఇప్పటికే ఖాతా ఉందా?

source: Amortisation Schedule
hi: चुकौती अनुसूची
kn: ಅಮೋರ್ಟೈಸೇಶನ್ ವೇಳಾಪಟ್ಟಿ
mr: परतफेड तक्ता
ta: திருப்பிச் செலுத்தும் அட்டவணை
te: తిరిగి చెల్లింపు షెడ్యూల్

source: Amount
hi: राशि
kn: ಮೊತ್ತ
mr: रक्कम
ta: தொகை
te: మొత్తం

source: Amount Disbursed
hi: वितरित राशि
kn: ವಿತರಿಸಲಾದ ಮೊತ್ತ
mr: वितरित रक्कम
ta: வழங்கப்பட்ட தொகை
te: విడుదలైన మొత్తం

source: Amount to Pay
hi: भुगतान की राशि
kn: ಪಾವತಿಸಬೇಕಾದ ಮೊತ್ತ
mr: भरायची रक्कम
ta: செலுத்த வேண்டிய தொகை
te: చెల్లించాల్సిన మొత్తం

source: Analytics
hi: एनालिटिक्स
kn: ವಿಶ್ಲೇಷಣೆ
mr: विश्लेषण
ta: பகுப்பாய்வு
te: విశ్లేషణలు

source: Animations
hi: एनिमेशन
kn: ಆನಿಮೇಶನ್‌ಗಳು
mr: अॅनिमेशन
ta: அனிமேஷன்கள்
te: యానిమేషన్లు

source: App ID: APP-4011-RX
hi: ऐप आईडी: APP-4011-RX
mr: अॅप आयडी: APP-4011-RX
ta: ஆப் ஐடி: APP-4011-RX
te: యాప్ ఐడి: APP-4011-RX

source: App ID: APP-9824-XT
hi: ऐप आईडी: APP-9824-XT
mr: अॅप आयडी: APP-9824-XT
ta: ஆப் ஐடி: APP-9824-XT
te: యాప్ ఐడి: APP-9824-XT

source: Application halted during credit review.
hi: क्रेडिट समीक्षा के दौरान आवेदन रोक दिया गया।
kn: ಕ್ರೆಡಿಟ್ ಪರಿಶೀಲನೆಯ ಸಮಯದಲ್ಲಿ ಅರ್ಜಿ ನಿಲ್ಲಿಸಲಾಗಿದೆ.
mr: क्रेडिट पुनरावलोकनादरम्यान अर्ज थांबवला गेला.
ta: கடன் மதிப்பாய்வின் போது விண்ணப்பம் நிறுத்தப்பட்டது.
te: క్రెడిట్ సమీక్ష సమయంలో దరఖాస్తు నిలిపివేయబడింది.

source: Application ID
hi: आवेदन आईडी
kn: ಅರ್ಜಿಯ ಐಡಿ
mr: अर्ज आयडी
ta: விண்ணப்ப ஐடி
te: దరఖాస్తు ID

source: Application Submitted
hi: आवेदन जमा किया गया
kn: ಅರ್ಜಿಯನ್ನು ಸಲ್ಲಿಸಲಾಗಿದೆ
mr: अर्ज सादर केला
ta: விண்ணப்பம் சமர்ப்பிக்கப்பட்டது
te: దరఖాస్తు సమర్పించబడింది

source: Application Submitted!
hi: आवेदन जमा हो गया!
kn: ಅರ್ಜಿಯನ್ನು ಸಲ್ಲಿಸಲಾಗಿದೆ!
mr: अर्ज सादर झाला!
ta: விண்ணப்பம் சமர்ப்பிக்கப்பட்டது!
te: దరఖాస్తు సమర్పించబడింది!

source: Application Unsuccessful
hi: आवेदन असफल
kn: ಅರ್ಜಿಗೆ ಅನುಮೋದನೆ ಸಿಗಲಿಲ್ಲ
mr: अर्ज मंजूर झाला नाही
ta: விண்ணப்பம் தோல்வியடைந்தது
te: దరఖాస్తు విజయవంతం కాలేదు

source: Applied Amount
hi: आवेदित राशि
kn: ಅರ್ಜಿಸಿದ ಮೊತ್ತ
mr: अर्ज केलेली रक्कम
ta: விண்ணப்பித்த தொகை
te: దరఖాస్తు చేసిన మొత్తం

source: Apply Now
hi: अभी आवेदन करें
kn: ಈಗಲೇ ಅರ್ಜಿ ಸಲ್ಲಿಸಿ
mr: आता अर्ज करा
ta: இப்போது விண்ணப்பிக்கவும்
te: ఇప్పుడే దరఖాస్తు చేయండి

source: Approval Time
hi: मंज़ूरी समय
kn: ಅನುಮೋದನೆ ಸಮಯ
mr: मंजुरी वेळ
ta: ஒப்புதல் நேரம்
te: ఆమోద సమయం

source: Authentication Failed
hi: प्रमाणीकरण विफल
kn: ಪ್ರಮಾಣೀಕರಣ ವಿಫಲವಾಗಿದೆ
mr: प्रमाणीकरण अयशस्वी
ta: அங்கீகாரம் தோல்வியடைந்தது
te: ధృవీకరణ విఫలమైంది

source: Authenticator App
hi: ऑथेंटिकेटर ऐप
kn: ಆಥೆಂಟಿಕೇಟರ್ ಆಪ್
mr: ऑथेंटिकेटर अॅप
ta: அங்கீகரிப்பு செயலி
te: ఆథెంటికేటర్ యాప్

source: Authenticator Code
hi: ऑथेंटिकेटर कोड
kn: ಆಥೆಂಟಿಕೇಟರ್ ಕೋಡ್
mr: ऑथेंटिकेटर कोड
ta: அங்கீகரிப்பு குறியீடு
te: ఆథెంటికేటర్ కోడ్

source: Authenticator enrollment needs an authenticated session.
hi: ऑथेंटिकेटर सेटअप के लिए प्रमाणित सत्र आवश्यक है।
mr: ऑथेंटिकेटर नोंदणीसाठी प्रमाणित सत्र आवश्यक आहे.
ta: Authenticator சேர்க்க அங்கீகரிக்கப்பட்ட அமர்வு தேவை.
te: Authenticator నమోదు కోసం ధృవీకరించిన సెషన్ అవసరం.

source: Authorize AutoPay
hi: AutoPay अधिकृत करें
kn: AutoPay ಅನುಮತಿಸಿ
mr: AutoPay अधिकृत करा
ta: AutoPay ஐ அங்கீகரிக்கவும்
te: AutoPay ను అనుమతించండి

source: Auto Loan
hi: ऑटो लोन
kn: ವಾಹನ ಸಾಲ
mr: वाहन कर्ज
ta: வாகனக் கடன்
te: వాహన రుణం

source: AutoPay
hi: ऑटो-पे
kn: ಸ್ವಯಂ ಪಾವತಿ
mr: ऑटो-पे
ta: ஆட்டோபே
te: ఆటోపే

source: AutoPay Activated
hi: AutoPay सक्रिय हो गया
kn: AutoPay ಸಕ್ರಿಯವಾಗಿದೆ
mr: AutoPay सक्रिय झाले
ta: AutoPay செயல்படுத்தப்பட்டது
te: AutoPay సక్రియమైంది

source: Back
hi: वापस
kn: ಹಿಂದೆ
mr: मागे
ta: பின்
te: వెనుకకు

source: Back to Home
hi: होम पर वापस जाएं
kn: ಮುಖಪುಟಕ್ಕೆ ಹಿಂತಿರುಗಿ
mr: होमवर परत जा
ta: முகப்பிற்கு திரும்பு
te: హోమ్‌కు తిరిగి వెళ్ళు

source: Back to login
hi: लॉगिन पर वापस जाएं
kn: ಲಾಗಿನ್‌ಗೆ ಹಿಂತಿರುಗಿ
mr: लॉगिनकडे परत जा
ta: உள்நுழைவுக்கு திரும்பு
te: లాగిన్‌కు తిరిగి వెళ్ళండి

source: Balance
hi: शेष
kn: ಬಾಕಿ
mr: शिल्लक
ta: இருப்பு
te: నిల్వ

source: Balance Over Time
hi: समय के साथ बैलेंस
kn: ಕಾಲಕ್ರಮದಲ್ಲಿ ಬಾಕಿ
mr: कालानुसार शिल्लक
ta: காலப்போக்கில் இருப்பு
te: కాలానుగుణంగా బాకీ

source: Bank
hi: बैंक
kn: ಬ್ಯಾಂಕ್
mr: बँक
ta: வங்கி
te: బ్యాంక్

source: Bank Account
hi: बैंक खाता
kn: ಬ್ಯಾಂಕ್ ಖಾತೆ
mr: बँक खाते
ta: வங்கி கணக்கு
te: బ్యాంక్ ఖాతా

source: Bank Mandate Required
hi: बैंक मैंडेट आवश्यक
kn: ಬ್ಯಾಂಕ್ ಅನುಮತಿ ಅಗತ್ಯವಿದೆ
mr: बँक मँडेट आवश्यक
ta: வங்கி ஆணை தேவை
te: బ్యాంక్ మాండేట్ అవసరం

source: Bank Statement
hi: बैंक स्टेटमेंट
kn: ಬ್ಯಾಂಕ್ ಸ್ಟೇಟ್ಮೆಂಟ್
mr: बँक स्टेटमेंट
ta: வங்கி அறிக்கை
te: బ్యాంక్ స్టేట్‌మెంట్

source: Based on your inputs, you meet the preliminary criteria for this loan.
hi: आपकी दी गई जानकारी के आधार पर आप इस ऋण के प्रारंभिक मानदंडों पर खरे उतरते हैं।
kn: ನಿಮ್ಮ ವಿವರಗಳ ಆಧಾರದಲ್ಲಿ, ಈ ಸಾಲಕ್ಕೆ ಅಗತ್ಯವಾದ ಪ್ರಾಥಮಿಕ ಮಾನದಂಡಗಳನ್ನು ನೀವು ಪೂರೈಸಿದ್ದೀರಿ.
mr: तुमच्या दिलेल्या माहितीनुसार तुम्ही या कर्जाच्या प्राथमिक निकषांना पात्र ठरता.
ta: உங்கள் உள்ளீடுகளின் அடிப்படையில், இந்த கடனின் ஆரம்ப தகுதிகளை நீங்கள் பூர்த்தி செய்கிறீர்கள்.
te: మీ ఇచ్చిన వివరాల ఆధారంగా, ఈ రుణానికి అవసరమైన ప్రాథమిక అర్హతలను మీరు చేరుకున్నారు.

source: Borrower Portal
hi: उधारकर्ता पोर्टल
kn: ಸಾಲಗಾರರ ಪೋರ್ಟಲ್
mr: कर्जदार पोर्टल
ta: கடனாளி போர்டல்
te: రుణగ్రహీత పోర్టల్

source: Breakdown
hi: विवरण
kn: ವಿಭಜನೆ
mr: विभागणी
ta: பிரிவு
te: విభజన

source: Camera verification
hi: कैमरा सत्यापन
kn: ಕ್ಯಾಮೆರಾ ಪರಿಶೀಲನೆ
mr: कॅमेरा पडताळणी
ta: கேமரா சரிபார்ப்பு
te: కెమెరా ధృవీకరణ

source: Chat with Loan Officer
hi: ऋण अधिकारी के साथ चैट करें
kn: ಸಾಲ ಅಧಿಕಾರಿ ಜೊತೆ ಚಾಟ್ ಮಾಡಿ
mr: कर्ज अधिकाऱ्यासोबत चॅट करा
ta: கடன் அதிகாரியுடன் உரையாடுங்கள்
te: రుణ అధికారితో చాట్ చేయండి

source: Check Eligibility
hi: पात्रता जाँचें
kn: ಅರ್ಹತೆ ಪರಿಶೀಲಿಸಿ
mr: पात्रता तपासा
ta: தகுதியை சரிபார்க்கவும்
te: అర్హతను తనిఖీ చేయండి

source: Check your document
hi: अपने दस्तावेज़ की जाँच करें
kn: ನಿಮ್ಮ ದಾಖಲೆ ಪರಿಶೀಲಿಸಿ
mr: तुमचा दस्तऐवज तपासा
ta: உங்கள் ஆவணத்தை சரிபார்க்கவும்
te: మీ పత్రాన్ని తనిఖీ చేయండి

source: Checked
hi: जाँचा गया
kn: ಪರಿಶೀಲಿಸಲಾಗಿದೆ
mr: तपासले
ta: சரிபார்க்கப்பட்டது
te: తనిఖీ చేయబడింది

source: Checking Face ID
hi: Face ID की जाँच हो रही है
kn: Face ID ಪರಿಶೀಲಿಸಲಾಗುತ್ತಿದೆ
mr: Face ID तपासत आहे
ta: Face ID சரிபார்க்கப்படுகிறது
te: Face ID తనిఖీ జరుగుతోంది

source: Checkout
hi: चेकआउट
kn: ಪಾವತಿ ಪೂರ್ಣಗೊಳಿಸಿ
mr: चेकआउट
ta: செக் அவுட்
te: చెక్‌అవుట్

source: Choose an EMI that fits your budget.
hi: अपने बजट के अनुसार EMI चुनें।
kn: ನಿಮ್ಮ ಬಜೆಟ್‌ಗೆ ತಕ್ಕ EMI ಆಯ್ಕೆಮಾಡಿ.
mr: तुमच्या बजेटला बसणारा EMI निवडा.
ta: உங்கள் பட்ஜெட்டுக்கு ஏற்ற EMI-ஐ தேர்வு செய்யவும்.
te: మీ బడ్జెట్‌కు సరిపోయే EMIని ఎంచుకోండి.

source: Choose an identity document
hi: एक पहचान दस्तावेज़ चुनें
kn: ಒಂದು ಗುರುತಿನ ದಾಖಲೆಯನ್ನು ಆಯ್ಕೆಮಾಡಿ
mr: ओळख दस्तऐवज निवडा
ta: ஒரு அடையாள ஆவணத்தைத் தேர்ந்தெடுக்கவும்
te: ఒక గుర్తింపు పత్రాన్ని ఎంచుకోండి

source: Choose one option below.
hi: नीचे दिए गए विकल्पों में से एक चुनें।
kn: ಕೆಳಗಿನ ಆಯ್ಕೆಯಿಂದ ಒಂದನ್ನು ಆಯ್ಕೆಮಾಡಿ.
mr: खालीलपैकी एक पर्याय निवडा.
ta: கீழே உள்ள ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவும்.
te: క్రింద ఉన్న ఒక ఎంపికను ఎంచుకోండి.

source: Choose one option to continue.
hi: जारी रखने के लिए एक विकल्प चुनें।
kn: ಮುಂದುವರಿಸಲು ಒಂದು ಆಯ್ಕೆಯನ್ನು ಆರಿಸಿ.
mr: पुढे जाण्यासाठी एक पर्याय निवडा.
ta: தொடர ஒரு விருப்பத்தைத் தேர்ந்தெடுக்கவும்.
te: కొనసాగించడానికి ఒక ఎంపికను ఎంచుకోండి.

source: Choose proof of address
hi: पते का प्रमाण चुनें
kn: ವಿಳಾಸದ ಸಾಕ್ಷ್ಯವನ್ನು ಆರಿಸಿ
mr: पत्त्याचा पुरावा निवडा
ta: முகவரி சான்றைத் தேர்ந்தெடுக்கவும்
te: చిరునామా ధృవీకరణ పత్రాన్ని ఎంచుకోండి

source: City
hi: शहर
kn: ನಗರ
mr: शहर
ta: நகரம்
te: నగరం

source: Clear
hi: साफ़ करें
kn: ತೊಲಗಿಸಿ
mr: साफ करा
ta: அழி
te: తొలగించు

source: Closed
hi: बंद
kn: ಮುಚ್ಚಲಾಗಿದೆ
mr: बंद
ta: மூடப்பட்டது
te: మూసివేయబడింది

source: Closed on 10 Oct 2025
hi: 10 अक्टूबर 2025 को बंद हो जाएगा
kn: 10 ಅಕ್ಟೋಬರ್ 2025ರಂದು ಮುಚ್ಚಲಾಗಿದೆ

source: Code sent to %@
hi: कोड %@ पर भेजा गया
mr: कोड %@ वर पाठवला
ta: குறியீடு %@ க்கு அனுப்பப்பட்டது
te: కోడ్ %@ కు పంపబడింది

source: Compare Loans
hi: लोन की तुलना करें
kn: ಸಾಲಗಳನ್ನು ಹೋಲಿಸಿ
mr: कर्जांची तुलना करा
ta: கடன்களை ஒப்பிடுங்கள்
te: రుణాలను పోల్చండి

source: Compare Options
hi: विकल्पों की तुलना करें
kn: ಆಯ್ಕೆಗಳನ್ನು ಹೋಲಿಸಿ
mr: पर्यायांची तुलना करा
ta: விருப்பங்களை ஒப்பிடுங்கள்
te: ఎంపికలను పోల్చండి

source: Compare Rates
hi: दर की तुलना करें
kn: ಬಡ್ಡಿದರಗಳನ್ನು ಹೋಲಿಸಿ
mr: दरांची तुलना करा
ta: விகிதங்களை ஒப்பிடுங்கள்
te: రేట్లను సరిపోల్చండి

source: Complete
hi: पूर्ण
kn: ಪೂರ್ಣಗೊಂಡಿದೆ
mr: पूर्ण
ta: முடிந்தது
te: పూర్తి

source: Complete all details to continue.
hi: जारी रखने के लिए सभी विवरण पूर्ण करें।
kn: ಮುಂದುವರಿಸಲು ಎಲ್ಲಾ ವಿವರಗಳನ್ನು ಪೂರ್ಣಗೊಳಿಸಿ.
mr: पुढे जाण्यासाठी सर्व तपशील पूर्ण करा.
ta: தொடர அனைத்து விவரங்களையும் பூர்த்தி செய்யவும்.
te: కొనసాగించడానికి అన్ని వివరాలు పూర్తి చేయండి.

source: Complete all sections to continue.
hi: जारी रखने के लिए सभी अनुभाग पूरे करें।
kn: ಮುಂದುವರಿಸಲು ಎಲ್ಲಾ ವಿಭಾಗಗಳನ್ನು ಪೂರ್ಣಗೊಳಿಸಿ.
mr: पुढे जाण्यासाठी सर्व विभाग पूर्ण करा.
ta: தொடர அனைத்து பிரிவுகளையும் பூர்த்தி செய்யவும்.
te: కొనసాగించడానికి అన్ని విభాగాలను పూర్తి చేయండి.

source: Complete income form & upload document to proceed.
hi: आगे बढ़ने के लिए आय फ़ॉर्म पूरा करें और दस्तावेज़ अपलोड करें।
kn: ಮುಂದುವರಿಸಲು ಆದಾಯ ಫಾರ್ಮ್ ಪೂರ್ಣಗೊಳಿಸಿ ಮತ್ತು ದಾಖಲೆಯನ್ನು ಅಪ್‌ಲೋಡ್ ಮಾಡಿ.
mr: पुढे जाण्यासाठी उत्पन्न फॉर्म पूर्ण करा आणि दस्तऐवज अपलोड करा.
ta: தொடர வருமானப் படிவத்தை பூர்த்தி செய்து ஆவணத்தை பதிவேற்றவும்.
te: కొనసాగడానికి ఆదాయ ఫారమ్ పూర్తి చేసి పత్రాన్ని అప్‌లోడ్ చేయండి.

source: Complete transparency on what you pay
hi: आप जो भुगतान करते हैं उस पर पूरी पारदर्शिता
kn: ನೀವು ಪಾವತಿಸುವದರ ಸಂಪೂರ್ಣ ಸ್ಪಷ್ಟತೆ
mr: तुम्ही काय भरता याची संपूर्ण पारदर्शकता
ta: நீங்கள் செலுத்துவதில் முழு வெளிப்படைத் தன்மை
te: మీరు చెల్లించేది గురించి పూర్తి పారదర్శకత

source: Complete your profile
hi: अपनी प्रोफ़ाइल पूरी करें
kn: ನಿಮ್ಮ ಪ್ರೊಫೈಲ್ ಪೂರ್ಣಗೊಳಿಸಿ
mr: तुमची प्रोफाइल पूर्ण करा
ta: உங்கள் சுயவிவரத்தை பூர்த்தி செய்யவும்
te: మీ ప్రొఫైల్‌ను పూర్తి చేయండి

source: Complete Your Profile
hi: अपनी प्रोफ़ाइल पूरी करें
kn: ನಿಮ್ಮ ಪ್ರೊಫೈಲ್ ಪೂರ್ಣಗೊಳಿಸಿ
mr: तुमची प्रोफाइल पूर्ण करा
ta: உங்கள் சுயவிவரத்தை முடிக்கவும்
te: మీ ప్రొఫైల్‌ను పూర్తి చేయండి

source: Configured
hi: कॉन्फ़िगर किया गया
kn: ಸಂರಚಿಸಲಾಗಿದೆ
mr: कॉन्फिगर केले
ta: அமைக்கப்பட்டது
te: కాన్ఫిగర్ చేయబడింది

source: Confirm & Submit
hi: पुष्टि करें और जमा करें
kn: ದೃಢೀಕರಿಸಿ ಮತ್ತು ಸಲ್ಲಿಸಿ
mr: पुष्टी करा आणि सादर करा
ta: உறுதிப்படுத்து மற்றும் சமர்ப்பி
te: నిర్ధారించి సమర్పించండి

source: Confirm the declaration to continue.
hi: जारी रखने के लिए घोषणा की पुष्टि करें।
kn: ಮುಂದುವರಿಸಲು ಘೋಷಣೆಯನ್ನು ದೃಢೀಕರಿಸಿ.
mr: पुढे जाण्यासाठी घोषणेला पुष्टी द्या.
ta: தொடர அறிவிப்பை உறுதிப்படுத்தவும்.
te: కొనసాగించడానికి ప్రకటనను నిర్ధారించండి.

source: Contact Support
hi: सहायता से संपर्क करें
kn: ಬೆಂಬಲವನ್ನು ಸಂಪರ್ಕಿಸಿ
mr: सहाय्याशी संपर्क साधा
ta: ஆதரவை தொடர்பு கொள்ளுங்கள்
te: సపోర్ట్‌ను సంప్రదించండి

source: Continue
hi: जारी रखें
kn: ಮುಂದುವರಿಸಿ
mr: पुढे चालू ठेवा
ta: தொடரவும்
te: కొనసాగించండి

source: Continue Verification
hi: सत्यापन जारी रखें
kn: ಪರಿಶೀಲನೆಯನ್ನು ಮುಂದುವರಿಸಿ
mr: पडताळणी सुरू ठेवा
ta: சரிபார்ப்பை தொடரவும்
te: ధృవీకరణ కొనసాగించండి

source: Copied
hi: कॉपी किया गया
kn: ನಕಲಿಸಲಾಗಿದೆ
mr: कॉपी केले
ta: நகலெடுக்கப்பட்டது
te: కాపీ చేయబడింది

source: Copy
hi: कॉपी करें
kn: ನಕಲು
mr: कॉपी करा
ta: நகலெடு
te: కాపీ చేయండి

source: Cost Breakdown
hi: लागत विवरण
kn: ವೆಚ್ಚದ ವಿಭಜನೆ
mr: खर्च विभागणी
ta: செலவு பிரிவு
te: ఖర్చు విభజన

source: Create account
hi: खाता बनाएं
kn: ಖಾತೆ ಸೃಷ್ಟಿಸಿ
mr: खाते तयार करा
ta: கணக்கை உருவாக்கு
te: ఖాతా సృష్టించండి

source: Credibility Score
hi: विश्वसनीयता स्कोर
kn: ವಿಶ್ವಾಸಾರ್ಹತೆ ಅಂಕ
mr: विश्वासार्हता स्कोअर
ta: நம்பகத்தன்மை மதிப்பெண்
te: నమ్మకార్హత స్కోర్

source: Credit Age
hi: क्रेडिट आयु
kn: ಕ್ರೆಡಿಟ್ ವಯಸ್ಸು
mr: क्रेडिट कालावधी
ta: கடன் வயது
te: క్రెడిట్ వయస్సు

source: Credit Assessment
hi: क्रेडिट मूल्यांकन
kn: ಕ್ರೆಡಿಟ್ ಮೌಲ್ಯಮಾಪನ
mr: क्रेडिट मूल्यांकन
ta: கடன் மதிப்பீடு
te: క్రెడిట్ మూల్యాంకనం

source: Credit Utilization
hi: क्रेडिट उपयोग
kn: ಕ್ರೆಡಿಟ್ ಬಳಕೆ
mr: क्रेडिट वापर
ta: கடன் பயன்பாடு
te: క్రెడిట్ వినియోగం

source: Current address
hi: वर्तमान पता
kn: ಪ್ರಸ್ತುತ ವಿಳಾಸ
mr: सध्याचा पत्ता
ta: தற்போதைய முகவரி
te: ప్రస్తుత చిరునామా

source: Current: ₹%@
hi: वर्तमान: ₹%@
kn: ಪ್ರಸ್ತುತ: ₹%@
mr: सध्याचे: ₹%@
ta: தற்போது: ₹%@
te: ప్రస్తుతం: ₹%@

source: Customize your loan
hi: अपना ऋण अनुकूलित करें
kn: ನಿಮ್ಮ ಸಾಲವನ್ನು ಕಸ್ಟಮೈಸ್ ಮಾಡಿ
mr: तुमचे कर्ज सानुकूल करा
ta: உங்கள் கடனை அமைத்துக்கொள்ளுங்கள்
te: మీ రుణాన్ని అనుకూలీకరించండి

source: Date of birth
hi: जन्म तिथि
kn: ಜನ್ಮ ದಿನಾಂಕ
mr: जन्मतारीख
ta: பிறந்த தேதி
te: పుట్టిన తేదీ

source: Days
hi: दिन
kn: ದಿನಗಳು
mr: दिवस
ta: நாட்கள்
te: రోజులు

source: December
hi: दिसंबर
kn: ಡಿಸೆಂಬರ್
mr: डिसेंबर
ta: டிசம்பர்
te: డిసెంబర్

source: Detailed breakdown of your current dues.
hi: आपके वर्तमान बकाया का विस्तृत विवरण।
kn: ನಿಮ್ಮ ಪ್ರಸ್ತುತ ಬಾಕಿಯ ವಿವರವಾದ ವಿಭಜನೆ.
mr: तुमच्या सध्याच्या थकबाकीचे सविस्तर विवरण.
ta: உங்கள் தற்போதைய நிலுவைகளின் விரிவான பிரிவு.
te: మీ ప్రస్తుత బాకీల యొక్క వివరణాత్మక విభజన.

source: Detailed snapshot of your financial health.
hi: आपकी वित्तीय स्थिति का विस्तृत स्नैपशॉट।
kn: ನಿಮ್ಮ ಆರ್ಥಿಕ ಸ್ಥಿತಿಯ ವಿವರವಾದ ಚಿತ್ರಣ.
mr: तुमच्या आर्थिक स्थितीचा सविस्तर आढावा.
ta: உங்கள் நிதி நிலையின் விரிவான கண்ணோட்டம்.
te: మీ ఆర్థిక స్థితి యొక్క వివరణాత్మక అవలోకనం.

source: Discover
hi: खोजें
kn: ಅನ್ವೇಷಿಸಿ
mr: शोधा
ta: கண்டறி
te: కనుగొనండి

source: Display
hi: डिस्प्ले
kn: ಪ್ರದರ್ಶನ
mr: डिस्प्ले
ta: காட்சி
te: ప్రదర్శన

source: Document
hi: दस्तावेज़
kn: ದಾಖಲೆ
mr: दस्तऐवज
ta: ஆவணம்
te: పత్రం

source: Document Verification
hi: दस्तावेज़ सत्यापन
kn: ದಾಖಲೆ ಪರಿಶೀಲನೆ
mr: दस्तऐवज पडताळणी
ta: ஆவண சரிபார்ப்பு
te: పత్రాల ధృవీకరణ

source: Document was unclear or incomplete
hi: दस्तावेज़ अस्पष्ट या अधूरा था
kn: ದಾಖಲೆ ಸ್ಪಷ್ಟವಾಗಿರಲಿಲ್ಲ ಅಥವಾ ಅಪೂರ್ಣವಾಗಿತ್ತು
mr: दस्तऐवज अस्पष्ट किंवा अपूर्ण होता
ta: ஆவணம் தெளிவற்றது அல்லது முழுமையற்றது
te: పత్రం స్పష్టంగా లేకపోయింది లేదా అసంపూర్ణంగా ఉంది

source: Documents
hi: दस्तावेज़
kn: ದಾಖಲೆಗಳು
mr: दस्तऐवज
ta: ஆவணங்கள்
te: పత్రాలు

source: Documents received.
hi: दस्तावेज़ प्राप्त हुए।
kn: ದಾಖಲೆಗಳನ್ನು ಸ್ವೀಕರಿಸಲಾಗಿದೆ.
mr: दस्तऐवज प्राप्त झाले.
ta: ஆவணங்கள் பெறப்பட்டன.
te: పత్రాలు స్వీకరించబడ్డాయి.

source: Don't have an account?
hi: क्या आपका खाता नहीं है?
kn: ಖಾತೆ ಇಲ್ಲವೇ?
mr: खाते नाही का?
ta: கணக்கு இல்லையா?
te: ఖాతా లేదా?

source: Done
hi: हो गया
kn: ಆಯಿತು
mr: पूर्ण
ta: முடிந்தது
te: పూర్తి

source: Download Complete
hi: डाउनलोड पूरा हुआ
kn: ಡೌನ್‌ಲೋಡ್ ಪೂರ್ಣಗೊಂಡಿದೆ
mr: डाउनलोड पूर्ण
ta: பதிவிறக்கம் முடிந்தது
te: డౌన్‌లోడ్ పూర్తయింది

source: Download No Dues Certificate
hi: नो ड्यूज़ प्रमाणपत्र डाउनलोड करें
kn: No Dues ಪ್ರಮಾಣಪತ್ರ ಡೌನ್‌ಲೋಡ್ ಮಾಡಿ
mr: नो ड्यूज प्रमाणपत्र डाउनलोड करा
ta: பாக்கி இல்லை சான்றிதழை பதிவிறக்கவும்
te: బకాయిలేమీ లేవు సర్టిఫికేట్‌ను డౌన్‌లోడ్ చేయండి

source: Download your monthly loan and transaction statements in PDF format.
hi: अपने मासिक ऋण और लेनदेन विवरण PDF में डाउनलोड करें।
kn: ನಿಮ್ಮ ಮಾಸಿಕ ಸಾಲ ಮತ್ತು ವ್ಯವಹಾರ ಸ್ಟೇಟ್ಮೆಂಟ್‌ಗಳನ್ನು PDF ರೂಪದಲ್ಲಿ ಡೌನ್‌ಲೋಡ್ ಮಾಡಿ.
mr: तुमची मासिक कर्ज आणि व्यवहार विवरणपत्रे PDF स्वरूपात डाउनलोड करा.
ta: உங்கள் மாதாந்திர கடன் மற்றும் பரிவர்த்தனை அறிக்கைகளை PDF வடிவில் பதிவிறக்கவும்.
te: మీ నెలవారీ రుణ మరియు లావాదేవీ స్టేట్‌మెంట్‌లను PDF రూపంలో డౌన్‌లోడ్ చేయండి.

source: Draft Applications
hi: ड्राफ्ट आवेदन
kn: ಕರಡು ಅರ್ಜಿಗಳು
mr: मसुदा अर्ज
ta: வரைவு விண்ணப்பங்கள்
te: డ్రాఫ్ట్ దరఖాస్తులు

source: Drafts
hi: ड्राफ्ट
kn: ಕರಡುಗಳು
mr: मसुदे
ta: வரைவுகள்
te: డ్రాఫ్ట్‌లు

source: E-Signature
hi: ई-हस्ताक्षर
kn: ಇ-ಸಹಿ
mr: ई-स्वाक्षरी
ta: மின்கையொப்பம்
te: ఈ-సంతకం

source: Edit Profile
hi: प्रोफ़ाइल संपादित करें
kn: ಪ್ರೊಫೈಲ್ ಸಂಪಾದಿಸಿ
mr: प्रोफाइल संपादित करा
ta: சுயவிவரத்தைத் திருத்து
te: ప్రొఫైల్ సవరించండి

source: Education Loan
hi: शिक्षा ऋण
kn: ಶೈಕ್ಷಣಿಕ ಸಾಲ
mr: शिक्षण कर्ज
ta: கல்விக் கடன்
te: విద్యా రుణం

source: Eligibility Check
hi: पात्रता जाँच
kn: ಅರ್ಹತೆ ಪರಿಶೀಲನೆ
mr: पात्रता तपासणी
ta: தகுதி சரிபார்ப்பு
te: అర్హత తనిఖీ

source: Email
hi: ईमेल
kn: ಇಮೇಲ್
mr: ईमेल
ta: மின்னஞ்சல்
te: ఇమెయిల్

source: Email Address
hi: ईमेल पता
kn: ಇಮೇಲ್ ವಿಳಾಸ
mr: ईमेल पत्ता
ta: மின்னஞ்சல் முகவரி
te: ఇమెయిల్ చిరునామా

source: EMI #%d of 18
hi: 18 में से EMI #%d
mr: 18 पैकी EMI #%d
ta: 18 இல் EMI #%d
te: 18లో EMI #%d

source: EMI #%lld of 18
hi: 18 में से EMI #%lld
mr: 18 पैकी EMI #%lld
ta: 18 இல் EMI #%lld
te: 18లో EMI #%lld

source: Employment type
hi: रोजगार प्रकार
kn: ಉದ್ಯೋಗ ಪ್ರಕಾರ
mr: रोजगार प्रकार
ta: வேலை வகை
te: ఉద్యోగ రకం

source: Employment Type
hi: रोजगार प्रकार
kn: ಉದ್ಯೋಗ ಪ್ರಕಾರ
mr: रोजगार प्रकार
ta: வேலைவகை
te: ఉద్యోగ రకం

source: Enable Face ID
hi: Face ID सक्षम करें
kn: Face ID ಸಕ್ರಿಯಗೊಳಿಸಿ
mr: Face ID सक्षम करा
ta: Face ID ஐ இயலுமைப்படுத்தவும்
te: Face ID ని ప్రారంభించండి

source: English
hi: अंग्रेज़ी
kn: ಇಂಗ್ಲಿಷ್
mr: इंग्रजी
ta: ஆங்கிலம்
te: ఆంగ్లం

source: Enter authenticator code
hi: ऑथेंटिकेटर कोड दर्ज करें
kn: ಆಥೆಂಟಿಕೇಟರ್ ಕೋಡ್ ನಮೂದಿಸಿ
mr: ऑथेंटिकेटर कोड टाका
ta: Authenticator குறியீட்டை உள்ளிடவும்
te: Authenticator కోడ్‌ను నమోదు చేయండి

source: Enter monthly income to continue.
hi: जारी रखने के लिए मासिक आय दर्ज करें।
kn: ಮುಂದುವರಿಸಲು ಮಾಸಿಕ ಆದಾಯ ನಮೂದಿಸಿ.
mr: पुढे जाण्यासाठी मासिक उत्पन्न प्रविष्ट करा.
ta: தொடர மாதாந்திர வருமானத்தை உள்ளிடவும்.
te: కొనసాగడానికి నెలవారీ ఆదాయాన్ని నమోదు చేయండి.

source: Enter the 6-digit code from your app.
hi: अपने ऐप से 6 अंकों का कोड दर्ज करें।
kn: ನಿಮ್ಮ ಆಪ್‌ನಿಂದ 6 ಅಂಕಿಯ ಕೋಡ್ ನಮೂದಿಸಿ.
mr: तुमच्या अॅपमधील 6-अंकी कोड टाका.
ta: உங்கள் செயலியில் உள்ள 6 இலக்க குறியீட்டை உள்ளிடவும்.
te: మీ యాప్‌లోని 6 అంకెల కోడ్‌ను నమోదు చేయండి.

source: Enter the 6-digit code generated by your app
hi: अपने ऐप द्वारा जनरेट किया गया 6 अंकों का कोड दर्ज करें
kn: ನಿಮ್ಮ ಆಪ್ ರಚಿಸಿದ 6 ಅಂಕಿಯ ಕೋಡ್ ನಮೂದಿಸಿ
mr: तुमच्या अॅपने तयार केलेला 6-अंकी कोड टाका
ta: உங்கள் செயலி உருவாக்கிய 6 இலக்க குறியீட்டை உள்ளிடவும்
te: మీ యాప్ సృష్టించిన 6 అంకెల కోడ్‌ను నమోదు చేయండి

source: Enter the 6-digit code sent to +91 ••••••222.
hi: +91 ••••••222 पर भेजा गया 6 अंकों का कोड दर्ज करें।
mr: +91 ••••••222 वर पाठवलेला 6-अंकी कोड टाका.
ta: +91 ••••••222 க்கு அனுப்பப்பட்ட 6 இலக்க குறியீட்டை உள்ளிடவும்.
te: +91 ••••••222 కు పంపిన 6 అంకెల కోడ్‌ను నమోదు చేయండి.

source: Enter the 6-digit code sent to s•••@gmail.com.
hi: s•••@gmail.com पर भेजा गया 6 अंकों का कोड दर्ज करें।
mr: s•••@gmail.com वर पाठवलेला 6-अंकी कोड टाका.
ta: s•••@gmail.com க்கு அனுப்பப்பட்ட 6 இலக்க குறியீட்டை உள்ளிடவும்.
te: s•••@gmail.com కు పంపిన 6 అంకెల కోడ్‌ను నమోదు చేయండి.
